class Place {
  String? id;
  String? title;
  String? caption;
  String? image;
  List<Category>? category;
  String? latitude;
  String? longitude;

  Place(
      {this.id,
      this.title,
      this.caption,
      this.image,
      this.category,
      this.latitude,
      this.longitude});

  Place.fromJson(Map<String, dynamic> json) {
    id = json['id'];
    title = json['title'];
    caption = json['caption'];
    image = json['image'];
    if (json['category'] != null) {
      category = <Category>[];
      json['category'].forEach((v) {
        category!.add(Category.fromJson(v));
      });
    }
    latitude = json['latitude'];
    longitude = json['longitude'];
  }

  Map<String, dynamic> toJson() {
    final Map<String, dynamic> data = <String, dynamic>{};
    data['id'] = id;
    data['title'] = title;
    data['title'] = caption;
    data['image'] = image;
    if (category != null) {
      data['category'] = category!.map((v) => v.toJson()).toList();
    }
    data['latitude'] = latitude;
    data['longitude'] = longitude;
    return data;
  }
}

class Category {
  String? id;
  String? title;

  Category({this.id, this.title});

  Category.fromJson(Map<String, dynamic> json) {
    id = json['id'];
    title = json['title'];
  }

  Map<String, dynamic> toJson() {
    final Map<String, dynamic> data = <String, dynamic>{};
    data['id'] = id;
    data['title'] = title;
    return data;
  }
}

List<Place> places = [
  Place(
    id: "1",
    title: "رستوران لی لی",
    caption:
        "کیست که کافه و کافی شاپ رفته باشد و لذت نبرده باشد؟! ولی باید گفت که آیا تاکنون کافه رستوران رفته‌اید؟! احتمالا همه‌ی ما چندین بار در طول عمرمان کافه‌ها را به عنوان یک مکان برای گذراندن اوقاتی با دوستان و یا خانواده خود انتخاب کردیم. اما اگر به شما بگویند یک مکان ویژه و جذاب تری که هم گزینه‌های موجود در کافه‌ها را پوشش می‌دهد و هم سرویس‌ها بیشتری را برای شما عرضه می‌کند، چه خواهید گفت؟ در این مقاله از وب سایت بروفه ما به بررسی 4 موضوع کلی و به بررسی این نکته که کافه رستوران یعنی چه و به چه مکانی گفته می‌شود پرداخته‌ایم. پس با ما همراه باشید.تفاوت‌های بین کافه و کافه رستوران ما برای این که شما را به خوبی با موضوع کافه رستوران چیست و به چه مکانی گفته می‌شود آشنا کنیم، رویکردی خاص اتخاذ کرده‌ایم؛ به این گونه که تفاوت‌های آن را با کافه‌ها برای شما عنوان کردیم تا در پایان شما به تمیز دادن کافه رستوران‌ها از کافه‌ها پی ببرید.کافه و کافه رستوران . دو واژه کافه و کافه رستوران از لحاظ واژگانی به هم خیلی شبیه و نزدیک می‌باشند، اما این دو واژه در اصل با هم تفاوت‌هایی دارند که ممکن است کمتر کسی به آن توجه کند. یکی از عمده تفاوت‌های بین کافه‌ها و کافه رستوران‌ها در این است که، کافه‌ها اماکنی صمیمی‌تر و دوستانه تری نسبت به یک کافه رستوران هستند. شاید بتوان گفت که فضای کلی یک کافه رستوران ، بیشتر شبیه به یک رستوران کوچک است که به همان شیوه نیز مدیریت می‌گردد. جدا از این مسائل نیز می‌توان گفت که تفاوت‌های مختلفی از لحاظ منوی سفارشاتی ، دکور ، نحوه سرو سفارشات و چیدمان وسایل و … در آن‌ها وجود دارد که در ادامه به آنها پرداختیم. کافه‌ و کافه رستوران‌ در بین ایرانیان. با توجه به این که فرهنگ استفاده از کافه‌ها و کافه رستوران‌ها در بین ایرانیان و به خصوص در بین جوانان روز به روز در حال رشد است، پرداختن به این موضوع و نحوه بهره وری صحیح لازم است. زیرا علاقمندان به دنبال پاسخ صحیح اسن سوال هستند که، واقعا کافه رستوران یعنی چه و چه تفاوتی با کافه‌ها دارد؟  بنابراین در ادامه با ما باشید تا به چندی دیگر از تفاوت‌های این دو آشنا شویم.",
    image:
        "https://i.pinimg.com/564x/0e/f7/e7/0ef7e7312fef6c8cca74e7a4b4834d64.jpg",
    category: [Category(id: '1', title: 'رستوران')],
    latitude: "37.42054247665374",
    longitude: "-122.08500232547522",
  ),
  Place(
    id: "2",
    title: "کافه شالند",
    caption:
        "کیست که کافه و کافی شاپ رفته باشد و لذت نبرده باشد؟! ولی باید گفت که آیا تاکنون کافه رستوران رفته‌اید؟! احتمالا همه‌ی ما چندین بار در طول عمرمان کافه‌ها را به عنوان یک مکان برای گذراندن اوقاتی با دوستان و یا خانواده خود انتخاب کردیم. اما اگر به شما بگویند یک مکان ویژه و جذاب تری که هم گزینه‌های موجود در کافه‌ها را پوشش می‌دهد و هم سرویس‌ها بیشتری را برای شما عرضه می‌کند، چه خواهید گفت؟ در این مقاله از وب سایت بروفه ما به بررسی 4 موضوع کلی و به بررسی این نکته که کافه رستوران یعنی چه و به چه مکانی گفته می‌شود پرداخته‌ایم. پس با ما همراه باشید.تفاوت‌های بین کافه و کافه رستوران ما برای این که شما را به خوبی با موضوع کافه رستوران چیست و به چه مکانی گفته می‌شود آشنا کنیم، رویکردی خاص اتخاذ کرده‌ایم؛ به این گونه که تفاوت‌های آن را با کافه‌ها برای شما عنوان کردیم تا در پایان شما به تمیز دادن کافه رستوران‌ها از کافه‌ها پی ببرید.کافه و کافه رستوران . دو واژه کافه و کافه رستوران از لحاظ واژگانی به هم خیلی شبیه و نزدیک می‌باشند، اما این دو واژه در اصل با هم تفاوت‌هایی دارند که ممکن است کمتر کسی به آن توجه کند. یکی از عمده تفاوت‌های بین کافه‌ها و کافه رستوران‌ها در این است که، کافه‌ها اماکنی صمیمی‌تر و دوستانه تری نسبت به یک کافه رستوران هستند. شاید بتوان گفت که فضای کلی یک کافه رستوران ، بیشتر شبیه به یک رستوران کوچک است که به همان شیوه نیز مدیریت می‌گردد. جدا از این مسائل نیز می‌توان گفت که تفاوت‌های مختلفی از لحاظ منوی سفارشاتی ، دکور ، نحوه سرو سفارشات و چیدمان وسایل و … در آن‌ها وجود دارد که در ادامه به آنها پرداختیم. کافه‌ و کافه رستوران‌ در بین ایرانیان. با توجه به این که فرهنگ استفاده از کافه‌ها و کافه رستوران‌ها در بین ایرانیان و به خصوص در بین جوانان روز به روز در حال رشد است، پرداختن به این موضوع و نحوه بهره وری صحیح لازم است. زیرا علاقمندان به دنبال پاسخ صحیح اسن سوال هستند که، واقعا کافه رستوران یعنی چه و چه تفاوتی با کافه‌ها دارد؟  بنابراین در ادامه با ما باشید تا به چندی دیگر از تفاوت‌های این دو آشنا شویم.",
    image:
        "https://i.pinimg.com/564x/88/66/91/88669101bfa812ce19224828884db28e.jpg",
    category: [Category(id: '2', title: 'کافه')],
    latitude: "37.41974630948776",
    longitude: "-122.08373934030533",
  ),
  Place(
    id: "3",
    title: "رستوران ایتالیایی سلیتی",
    caption:
        "کیست که کافه و کافی شاپ رفته باشد و لذت نبرده باشد؟! ولی باید گفت که آیا تاکنون کافه رستوران رفته‌اید؟! احتمالا همه‌ی ما چندین بار در طول عمرمان کافه‌ها را به عنوان یک مکان برای گذراندن اوقاتی با دوستان و یا خانواده خود انتخاب کردیم. اما اگر به شما بگویند یک مکان ویژه و جذاب تری که هم گزینه‌های موجود در کافه‌ها را پوشش می‌دهد و هم سرویس‌ها بیشتری را برای شما عرضه می‌کند، چه خواهید گفت؟ در این مقاله از وب سایت بروفه ما به بررسی 4 موضوع کلی و به بررسی این نکته که کافه رستوران یعنی چه و به چه مکانی گفته می‌شود پرداخته‌ایم. پس با ما همراه باشید.تفاوت‌های بین کافه و کافه رستوران ما برای این که شما را به خوبی با موضوع کافه رستوران چیست و به چه مکانی گفته می‌شود آشنا کنیم، رویکردی خاص اتخاذ کرده‌ایم؛ به این گونه که تفاوت‌های آن را با کافه‌ها برای شما عنوان کردیم تا در پایان شما به تمیز دادن کافه رستوران‌ها از کافه‌ها پی ببرید.کافه و کافه رستوران . دو واژه کافه و کافه رستوران از لحاظ واژگانی به هم خیلی شبیه و نزدیک می‌باشند، اما این دو واژه در اصل با هم تفاوت‌هایی دارند که ممکن است کمتر کسی به آن توجه کند. یکی از عمده تفاوت‌های بین کافه‌ها و کافه رستوران‌ها در این است که، کافه‌ها اماکنی صمیمی‌تر و دوستانه تری نسبت به یک کافه رستوران هستند. شاید بتوان گفت که فضای کلی یک کافه رستوران ، بیشتر شبیه به یک رستوران کوچک است که به همان شیوه نیز مدیریت می‌گردد. جدا از این مسائل نیز می‌توان گفت که تفاوت‌های مختلفی از لحاظ منوی سفارشاتی ، دکور ، نحوه سرو سفارشات و چیدمان وسایل و … در آن‌ها وجود دارد که در ادامه به آنها پرداختیم. کافه‌ و کافه رستوران‌ در بین ایرانیان. با توجه به این که فرهنگ استفاده از کافه‌ها و کافه رستوران‌ها در بین ایرانیان و به خصوص در بین جوانان روز به روز در حال رشد است، پرداختن به این موضوع و نحوه بهره وری صحیح لازم است. زیرا علاقمندان به دنبال پاسخ صحیح اسن سوال هستند که، واقعا کافه رستوران یعنی چه و چه تفاوتی با کافه‌ها دارد؟  بنابراین در ادامه با ما باشید تا به چندی دیگر از تفاوت‌های این دو آشنا شویم.",
    image:
        "https://i.pinimg.com/564x/78/cc/dd/78ccdd4f809e9c7174836803bfcb688f.jpg",
    category: [
      Category(id: '1', title: 'رستوران'),
      Category(id: '2', title: 'کافه')
    ],
    latitude: "37.42346372520506",
    longitude: "-122.08482429385187",
  ),
  Place(
    id: "4",
    title: "تفرجگاه نمک ابرود",
    caption:
        "کیست که کافه و کافی شاپ رفته باشد و لذت نبرده باشد؟! ولی باید گفت که آیا تاکنون کافه رستوران رفته‌اید؟! احتمالا همه‌ی ما چندین بار در طول عمرمان کافه‌ها را به عنوان یک مکان برای گذراندن اوقاتی با دوستان و یا خانواده خود انتخاب کردیم. اما اگر به شما بگویند یک مکان ویژه و جذاب تری که هم گزینه‌های موجود در کافه‌ها را پوشش می‌دهد و هم سرویس‌ها بیشتری را برای شما عرضه می‌کند، چه خواهید گفت؟ در این مقاله از وب سایت بروفه ما به بررسی 4 موضوع کلی و به بررسی این نکته که کافه رستوران یعنی چه و به چه مکانی گفته می‌شود پرداخته‌ایم. پس با ما همراه باشید.تفاوت‌های بین کافه و کافه رستوران ما برای این که شما را به خوبی با موضوع کافه رستوران چیست و به چه مکانی گفته می‌شود آشنا کنیم، رویکردی خاص اتخاذ کرده‌ایم؛ به این گونه که تفاوت‌های آن را با کافه‌ها برای شما عنوان کردیم تا در پایان شما به تمیز دادن کافه رستوران‌ها از کافه‌ها پی ببرید.کافه و کافه رستوران . دو واژه کافه و کافه رستوران از لحاظ واژگانی به هم خیلی شبیه و نزدیک می‌باشند، اما این دو واژه در اصل با هم تفاوت‌هایی دارند که ممکن است کمتر کسی به آن توجه کند. یکی از عمده تفاوت‌های بین کافه‌ها و کافه رستوران‌ها در این است که، کافه‌ها اماکنی صمیمی‌تر و دوستانه تری نسبت به یک کافه رستوران هستند. شاید بتوان گفت که فضای کلی یک کافه رستوران ، بیشتر شبیه به یک رستوران کوچک است که به همان شیوه نیز مدیریت می‌گردد. جدا از این مسائل نیز می‌توان گفت که تفاوت‌های مختلفی از لحاظ منوی سفارشاتی ، دکور ، نحوه سرو سفارشات و چیدمان وسایل و … در آن‌ها وجود دارد که در ادامه به آنها پرداختیم. کافه‌ و کافه رستوران‌ در بین ایرانیان. با توجه به این که فرهنگ استفاده از کافه‌ها و کافه رستوران‌ها در بین ایرانیان و به خصوص در بین جوانان روز به روز در حال رشد است، پرداختن به این موضوع و نحوه بهره وری صحیح لازم است. زیرا علاقمندان به دنبال پاسخ صحیح اسن سوال هستند که، واقعا کافه رستوران یعنی چه و چه تفاوتی با کافه‌ها دارد؟  بنابراین در ادامه با ما باشید تا به چندی دیگر از تفاوت‌های این دو آشنا شویم.",
    image:
        "https://i.pinimg.com/564x/b2/ea/00/b2ea00ff88b80a84c90161a33c34a5b0.jpg",
    category: [
      Category(id: '1', title: 'رستوران'),
      Category(id: '3', title: 'استراحت گاه')
    ],
    latitude: "37.422438864819014",
    longitude: "-122.08227720111609",
  ),
  Place(
    id: "5",
    title: "استراحت گاه ابشار",
    caption:
        "کیست که کافه و کافی شاپ رفته باشد و لذت نبرده باشد؟! ولی باید گفت که آیا تاکنون کافه رستوران رفته‌اید؟! احتمالا همه‌ی ما چندین بار در طول عمرمان کافه‌ها را به عنوان یک مکان برای گذراندن اوقاتی با دوستان و یا خانواده خود انتخاب کردیم. اما اگر به شما بگویند یک مکان ویژه و جذاب تری که هم گزینه‌های موجود در کافه‌ها را پوشش می‌دهد و هم سرویس‌ها بیشتری را برای شما عرضه می‌کند، چه خواهید گفت؟ در این مقاله از وب سایت بروفه ما به بررسی 4 موضوع کلی و به بررسی این نکته که کافه رستوران یعنی چه و به چه مکانی گفته می‌شود پرداخته‌ایم. پس با ما همراه باشید.تفاوت‌های بین کافه و کافه رستوران ما برای این که شما را به خوبی با موضوع کافه رستوران چیست و به چه مکانی گفته می‌شود آشنا کنیم، رویکردی خاص اتخاذ کرده‌ایم؛ به این گونه که تفاوت‌های آن را با کافه‌ها برای شما عنوان کردیم تا در پایان شما به تمیز دادن کافه رستوران‌ها از کافه‌ها پی ببرید.کافه و کافه رستوران . دو واژه کافه و کافه رستوران از لحاظ واژگانی به هم خیلی شبیه و نزدیک می‌باشند، اما این دو واژه در اصل با هم تفاوت‌هایی دارند که ممکن است کمتر کسی به آن توجه کند. یکی از عمده تفاوت‌های بین کافه‌ها و کافه رستوران‌ها در این است که، کافه‌ها اماکنی صمیمی‌تر و دوستانه تری نسبت به یک کافه رستوران هستند. شاید بتوان گفت که فضای کلی یک کافه رستوران ، بیشتر شبیه به یک رستوران کوچک است که به همان شیوه نیز مدیریت می‌گردد. جدا از این مسائل نیز می‌توان گفت که تفاوت‌های مختلفی از لحاظ منوی سفارشاتی ، دکور ، نحوه سرو سفارشات و چیدمان وسایل و … در آن‌ها وجود دارد که در ادامه به آنها پرداختیم. کافه‌ و کافه رستوران‌ در بین ایرانیان. با توجه به این که فرهنگ استفاده از کافه‌ها و کافه رستوران‌ها در بین ایرانیان و به خصوص در بین جوانان روز به روز در حال رشد است، پرداختن به این موضوع و نحوه بهره وری صحیح لازم است. زیرا علاقمندان به دنبال پاسخ صحیح اسن سوال هستند که، واقعا کافه رستوران یعنی چه و چه تفاوتی با کافه‌ها دارد؟  بنابراین در ادامه با ما باشید تا به چندی دیگر از تفاوت‌های این دو آشنا شویم.",
    image:
        "https://i.pinimg.com/564x/18/43/be/1843be1cde7e1a21c0a170083d619ecd.jpg",
    category: [
      Category(id: '1', title: 'رستوران'),
      Category(id: '3', title: 'استراحت گاه')
    ],
    latitude: "37.421952124445994",
    longitude: "-122.08563968539238",
  ),
  Place(
    id: "6",
    title: "کافی کاپ",
    caption:
        "کیست که کافه و کافی شاپ رفته باشد و لذت نبرده باشد؟! ولی باید گفت که آیا تاکنون کافه رستوران رفته‌اید؟! احتمالا همه‌ی ما چندین بار در طول عمرمان کافه‌ها را به عنوان یک مکان برای گذراندن اوقاتی با دوستان و یا خانواده خود انتخاب کردیم. اما اگر به شما بگویند یک مکان ویژه و جذاب تری که هم گزینه‌های موجود در کافه‌ها را پوشش می‌دهد و هم سرویس‌ها بیشتری را برای شما عرضه می‌کند، چه خواهید گفت؟ در این مقاله از وب سایت بروفه ما به بررسی 4 موضوع کلی و به بررسی این نکته که کافه رستوران یعنی چه و به چه مکانی گفته می‌شود پرداخته‌ایم. پس با ما همراه باشید.تفاوت‌های بین کافه و کافه رستوران ما برای این که شما را به خوبی با موضوع کافه رستوران چیست و به چه مکانی گفته می‌شود آشنا کنیم، رویکردی خاص اتخاذ کرده‌ایم؛ به این گونه که تفاوت‌های آن را با کافه‌ها برای شما عنوان کردیم تا در پایان شما به تمیز دادن کافه رستوران‌ها از کافه‌ها پی ببرید.کافه و کافه رستوران . دو واژه کافه و کافه رستوران از لحاظ واژگانی به هم خیلی شبیه و نزدیک می‌باشند، اما این دو واژه در اصل با هم تفاوت‌هایی دارند که ممکن است کمتر کسی به آن توجه کند. یکی از عمده تفاوت‌های بین کافه‌ها و کافه رستوران‌ها در این است که، کافه‌ها اماکنی صمیمی‌تر و دوستانه تری نسبت به یک کافه رستوران هستند. شاید بتوان گفت که فضای کلی یک کافه رستوران ، بیشتر شبیه به یک رستوران کوچک است که به همان شیوه نیز مدیریت می‌گردد. جدا از این مسائل نیز می‌توان گفت که تفاوت‌های مختلفی از لحاظ منوی سفارشاتی ، دکور ، نحوه سرو سفارشات و چیدمان وسایل و … در آن‌ها وجود دارد که در ادامه به آنها پرداختیم. کافه‌ و کافه رستوران‌ در بین ایرانیان. با توجه به این که فرهنگ استفاده از کافه‌ها و کافه رستوران‌ها در بین ایرانیان و به خصوص در بین جوانان روز به روز در حال رشد است، پرداختن به این موضوع و نحوه بهره وری صحیح لازم است. زیرا علاقمندان به دنبال پاسخ صحیح اسن سوال هستند که، واقعا کافه رستوران یعنی چه و چه تفاوتی با کافه‌ها دارد؟  بنابراین در ادامه با ما باشید تا به چندی دیگر از تفاوت‌های این دو آشنا شویم.",
    image:
        "https://i.pinimg.com/564x/5e/e7/d5/5ee7d584c753b2c6b8642757d74f76dc.jpg",
    category: [Category(id: '2', title: 'کافه')],
    latitude: "37.41802959516053",
    longitude: "-122.08556391298771",
  ),
  Place(
    id: "7",
    title: "کبابی دشت کبیر",
    caption:
        "کیست که کافه و کافی شاپ رفته باشد و لذت نبرده باشد؟! ولی باید گفت که آیا تاکنون کافه رستوران رفته‌اید؟! احتمالا همه‌ی ما چندین بار در طول عمرمان کافه‌ها را به عنوان یک مکان برای گذراندن اوقاتی با دوستان و یا خانواده خود انتخاب کردیم. اما اگر به شما بگویند یک مکان ویژه و جذاب تری که هم گزینه‌های موجود در کافه‌ها را پوشش می‌دهد و هم سرویس‌ها بیشتری را برای شما عرضه می‌کند، چه خواهید گفت؟ در این مقاله از وب سایت بروفه ما به بررسی 4 موضوع کلی و به بررسی این نکته که کافه رستوران یعنی چه و به چه مکانی گفته می‌شود پرداخته‌ایم. پس با ما همراه باشید.تفاوت‌های بین کافه و کافه رستوران ما برای این که شما را به خوبی با موضوع کافه رستوران چیست و به چه مکانی گفته می‌شود آشنا کنیم، رویکردی خاص اتخاذ کرده‌ایم؛ به این گونه که تفاوت‌های آن را با کافه‌ها برای شما عنوان کردیم تا در پایان شما به تمیز دادن کافه رستوران‌ها از کافه‌ها پی ببرید.کافه و کافه رستوران . دو واژه کافه و کافه رستوران از لحاظ واژگانی به هم خیلی شبیه و نزدیک می‌باشند، اما این دو واژه در اصل با هم تفاوت‌هایی دارند که ممکن است کمتر کسی به آن توجه کند. یکی از عمده تفاوت‌های بین کافه‌ها و کافه رستوران‌ها در این است که، کافه‌ها اماکنی صمیمی‌تر و دوستانه تری نسبت به یک کافه رستوران هستند. شاید بتوان گفت که فضای کلی یک کافه رستوران ، بیشتر شبیه به یک رستوران کوچک است که به همان شیوه نیز مدیریت می‌گردد. جدا از این مسائل نیز می‌توان گفت که تفاوت‌های مختلفی از لحاظ منوی سفارشاتی ، دکور ، نحوه سرو سفارشات و چیدمان وسایل و … در آن‌ها وجود دارد که در ادامه به آنها پرداختیم. کافه‌ و کافه رستوران‌ در بین ایرانیان. با توجه به این که فرهنگ استفاده از کافه‌ها و کافه رستوران‌ها در بین ایرانیان و به خصوص در بین جوانان روز به روز در حال رشد است، پرداختن به این موضوع و نحوه بهره وری صحیح لازم است. زیرا علاقمندان به دنبال پاسخ صحیح اسن سوال هستند که، واقعا کافه رستوران یعنی چه و چه تفاوتی با کافه‌ها دارد؟  بنابراین در ادامه با ما باشید تا به چندی دیگر از تفاوت‌های این دو آشنا شویم.",
    image:
        "https://i.pinimg.com/564x/af/be/c0/afbec0c6175a620f1c71017359487807.jpg",
    category: [
      Category(id: '1', title: 'رستوران'),
    ],
    latitude: "37.4195258309298",
    longitude: "-122.08068832755089",
  ),
];

List<Category> categorys = [
  Category(id: "1", title: 'رستوران'),
  Category(id: '2', title: 'کافه'),
  Category(id: '3', title: 'استراحت گاه'),
  Category(id: '4', title: 'فروشگاه')
];
